{
  "en": {
    "DESCRIPTION_P1": "I am 31 years old and live in Rio Grande do Sul, Brazil. I am married to Rafaela and a father to Helena.",
    "DESCRIPTION_P2": "In addition to being a Software Developer, I am also a writer and the owner of Paranoia Jogos, a company that started as an Escape Game and now focuses on game development.",
    "DESCRIPTION_P3": "My first book is currently under review and is expected to be published in 2026.",
    "DESCRIPTION_P4": "I am passionate about movies, series, books, board games, and RPGs.",
    "DESCRIPTION_P5": "To be closer to my family, I have been seeking remote job opportunities, aiming to fulfill my dream of working internationally.",
    "DESCRIPTION_P6": "In my current professional phase, I want to bring my passions closer to my work, which is why I have been studying game development and technologies that connect me with them.",
    "DESCRIPTION_P7": "I believe technology is a powerful tool for transforming the world, and I am always eager to learn and grow as a professional.",
    "DESCRIPTION_P8": "Always open to new opportunities and challenges, I believe collaboration and teamwork are essential for achieving great results.",
    "DESCRIPTION_P9": "If you are looking for a technology enthusiast with a broad, innovative, and creative vision, I am here to help.",
    "DESCRIPTION_P10": "Let's transform ideas into reality together!"
  },
  "pt": {
    "DESCRIPTION_P1": "Tenho 31 anos e moro no Rio Grande do Sul, Brasil, sou casado com a Rafaela e pai da Helena.",
    "DESCRIPTION_P2": "Além de ser Desenvolvedor de Software, também sou escritor, e dono da Paranoia Jogos, uma empresa que começou como Escape Game e hoje trabalha com o foco no desenvolvimento de jogos.",
    "DESCRIPTION_P3": "Meu primeiro livro já está em revisão, e deve ser publicado no ano de 2026.",
    "DESCRIPTION_P4": "Também sou apaixonado por filmes, séries e livros, e amante de jogos de tabuleiro, e RPG.",
    "DESCRIPTION_P5": "Hoje, para estar mais próximo da minha família, venho tentando atuar em vagas remotas, buscando realizar meu sonho de trabalhar em uma oportunidade internacional.",
    "DESCRIPTION_P6": "No meu atual momento profissional, querendo aproximar cada vez mais minhas paixões com meu lado profissional, por isso, venho estudando desenvolvimento de jogos e tecnologias que podem me colocar em contato com elas.",
    "DESCRIPTION_P7": "Acredito que a tecnologia é uma ferramenta poderosa para transformar o mundo, e estou sempre em busca de aprender e evoluir como profissional.",
    "DESCRIPTION_P8": "Sempre aberto a novas oportunidades e desafios, acredito que a colaboração e o trabalho em equipe são fundamentais para alcançar grandes resultados.",
    "DESCRIPTION_P9": "Se você está procurando um profissional apaixonado por tecnologia, com uma visão ampla, inovadora e criativa estou aqui para ajudar.",
    "DESCRIPTION_P10": "Vamos juntos transformar ideias em realidade!"
  }
}