{
  "en": {
    "TITLE_1": "Summary",
    "RESUME_P1": "Deu Crítico was a tabletop RPG platform I created in 2019.",
    "RESUME_P2": "The original idea was to develop a free, easy-to-use product as an alternative to other platforms with complex interfaces.",
    "RESUME_P3": "It was also an opportunity to hone my skills in front‑end development and integrations with a back‑end built using Node.js.",
    "RESUME_P4": "I chose a challenging, comprehensive project that combined multiple technologies, extensive service integrations, and above all—fun.",
    "RESUME_P5": "As an RPG player myself, I saw in the platform a chance to grow professionally, while building a robust solution addressing the shortcomings I’d encountered in other similar services.",

    "TITLE_2": "How It Works",
    "FUNCTIONING_P1": "Users could register via the website or using their Google accounts.",
    "FUNCTIONING_P2": "Once registered, users could create game rooms and invite other players to join.",
    "FUNCTIONING_P3": "Invitations were sent using Socket.io, so players received real-time notifications.",
    "FUNCTIONING_P4": "After accepting the invite, players created their characters and then joined the room.",

    "TITLE_3": "Technologies and Implementation",
    "TECHSTACK_P1": "The project was built with <b>Angular 9</b> and <b>TypeScript</b>, using <b>HTML</b> and <b>CSS</b> to create the front‑end.",
    "TECHSTACK_P2": "To store player and game-room data, <b>Firebase</b> was chosen for its speed in enabling CRUD operations, authentication, and lightweight backend functionality.",
    "TECHSTACK_P3": "To support real‑time communication between multiple clients in a game session, we used <b>Socket.io</b>, with the back‑end implemented in <b>Node.js</b> and <b>Express</b>.",
    "TECHSTACK_P4": "The project was hosted on <b>Google Cloud Platform</b>, with the server running on <b>AWS</b>.",
    "TECHSTACK_P5": "For graphical components, we used the <b>Fabric.js</b> library, customizing its tools to meet the project’s needs.",
    "TECHSTACK_P6": "We also integrated with <b>Imgur</b> to provide an image library service for users to use during sessions.",

    "TITLE_4": "Tabletop Features",
    "FEATURES_LI_1": "Real-time room sharing",
    "FEATURES_LI_2": "Separate fog-of-war reveal system for maps and tokens, using Bézier tools",
    "FEATURES_LI_3": "RPG dice rolling (individual or cumulative) in multiple dice types (D2, D4, D6, D8, D10, D12, D20, D100)",
    "FEATURES_LI_4": "Per-player inventory system with send/receive item actions",
    "FEATURES_LI_5": "Background and individual sound effects management",
    "FEATURES_LI_6": "Video chat with options to specify listeners",
    "FEATURES_LI_7": "Pixel ruler and custom-distance registration for use in the tabletop",
    "FEATURES_LI_8": "Static and animated map loading",
    "FEATURES_LI_9": "Image sharing between players",
    "FEATURES_LI_10": "Integration with Imgur or external links for managing in‑game images",
    "FEATURES_LI_11": "Layering system for tabletop objects",
    "FEATURES_LI_12": "Informational tokens for player statuses",
    "FEATURES_LI_13": "Map pings between players",
    "FEATURES_LI_14": "Camera control to focus the view for the room admin",
    "FEATURES_LI_15": "Custom icons for tokens",
    "FEATURES_LI_16": "Duplicate objects on the tabletop",
    "FEATURES_LI_17": "Grid overlay for the tabletop",
    "FEATURES_LI_18": "Brush and shape tools with brush-size control",
    "FEATURES_LI_19": "Object deletion with multiple options",
    "FEATURES_LI_20": "Token health bars",
    "FEATURES_LI_21": "Scene-wide token list",
    "FEATURES_LI_22": "Custom toast message system without external libraries",

    "TITLE_5": "Real-Time Sharing, Reveal System, and Video Chat",
    "FEATURE_1_P1": "Multiple users received live updates to the tabletop from the room administrator.",
    "FEATURE_1_P2": "The reveal system allowed the admin to expose specific parts of the map or tokens using Bézier tools or native tabletop objects.",
    "FEATURE_1_P3": "Video chat let players interact in real time and restrict who can hear, enabling richer gameplay scenarios.",

    "TITLE_6": "RPG Dice Rolling System",
    "FEATURE_2_P1": "Players could roll dice individually or cumulatively, choosing the number and type of dice.",
    "FEATURE_2_P2": "Dice rolls occurred in real time, with results shared instantly among all players in the room.",

    "TITLE_7": "Map Upload and Drawing Tools",
    "FEATURE_3_P1": "Users could upload static or animated maps to the tabletop, visible to all players.",
    "FEATURE_3_P2": "These maps could be direct links hosted on image services or stored in cloud storage like Dropbox.",
    "FEATURE_3_P3": "Players could also draw freely across the scene, with those drawings shared in real time.",

    "TITLE_8": "Player Inventory and Image Sharing",
    "FEATURE_4_P1": "Each player had their own inventory to store items and share them with other players, organized by types defined by the admin.",
    "FEATURE_4_P2": "Players could send and receive items via the inventory, facilitating resource exchange during gameplay.",
    "FEATURE_4_P3": "Admins could distribute items—like rewards or equipment—to players and share images for in‑room display via the inventory.",
    "FEATURE_4_P4": "The inventory was essential for game dynamics, allowing efficient resource management and item details visibility.",

    "TITLE_9": "Background and Effect Sound System",
    "FEATURE_5_P1": "Through the sound system, admins could play background music and sound effects in real time for all room participants.",
    "FEATURE_5_P2": "Sounds were registered via hosted audio links (e.g. <b>SoundCloud</b>) or direct audio file URLs to be used throughout the session.",
    "FEATURE_5_P3": "Admins could control volume individually, tailoring audio experience per player.",
    "FEATURE_5_P4": "Looped background or effect sounds could be used for continuous ambiance or triggered at specific moments.",

    "TITLE_10": "Pixel Ruler, Token Icons, and Object Layering",
    "FEATURE_6_P1": "The pixel ruler allowed the admin to display distances between specific points on the map.",
    "FEATURE_6_P2": "Token icons enabled custom markings on individual player tokens.",
    "FEATURE_6_P3": "The layer system let the admin organize tabletop objects into hierarchical levels.",

    "TITLE_11": "Learnings",
    "LEARNINGS_P1": "With this project, I was able to refine my skills in <b>Angular</b>, <b>Node.js</b>, and front‑end development overall.",
    "LEARNINGS_P2": "It was also great to work with technologies like <b>FabricJS</b>, <b>Socket.io</b>, and <b>Firebase</b>.",
    "LEARNINGS_P3": "Today, Deu Crítico is no longer under active development, as my focus has shifted to other projects.",
    "LEARNINGS_P4": "I’m now a more complete professional, capable of developing this platform even more fully—with new features and enhancements."
  },
  "pt": {
    "TITLE_1":"Resumo",
    "RESUME_P1": "Deu Critico foi um projeto de TableTop para jogos de RPG criado por mim em 2019.",
    "RESUME_P2": "A ideia original era desenvolver um produto gratuito e de fácil uso para concorrer com outras plataformas que tinham o uso complexo.",
    "RESUME_P3": "Além disso, foi usado para aperfeiçoar minhas habilidades com <b>front-end</b>, e suas integrações com um  <b>back-end</b> implementado com <b>NodeJs</b>.",
    "RESUME_P4": "Eu quis escolher um projeto complexo, que fosse alinhar um grande desafio, o uso de várias tecnologias, com muita integração entre serviços e ao mesmo tempo, diversão.",
    "RESUME_P5": "Eu como jogador de RPG, via na ferramenta uma grande oportunidade para crescer profissionalmente, ao mesmo tempo em que desenvolvia uma solução robusta para os problemas que eu encontrava em plataformas que tinham o mesmo papel.",
    
    "TITLE_2":"Funcionamento",
    "FUNCTIONING_P1": "Os usuários faziam seu cadastro através do site, ou pela integração com suas contas da Google.",
    "FUNCTIONING_P2": "Uma vez cadastrados, os usuários teriam como criar suas salas de jogos, onde poderiam convidar outros jogadores para participar.",
    "FUNCTIONING_P3": "O convite era enviado por <b>Socket.io</b> para o jogador, que receberia uma notificação em tempo real.",
    "FUNCTIONING_P4": "Após aceitar o convite, o jogador deveria criar seu personagem, e então, poderia entrar na sala",

    "TITLE_3":"Tecnologias e Implementação",
    "TECHSTACK_P1": "O projeto foi desenvolvido com <b>Angular 9</b> e <b>TypeScript</b>, utilizando <b>HTML</b> e <b>CSS</b> para a construção do front-end.",
    "TECHSTACK_P2": "Para armazenar informações dos jogadores e da mesa, foi escolhido o <b>Firebase</b> como banco de dados, uma vez que isso agilizaria a implementação de um backend para CRUD, sistema de autenticação e funcionalidades mais simples.",
    "TECHSTACK_P3": "Para implementar a comunicação entre multiplos clientes acessando um jogo, foi feito uso de <b>Socket.io</b> onde o backend do servidor foi implementado com <b>NodeJs</b> e <b>Express</b>.",
    "TECHSTACK_P4": "Além disso, o projeto foi hospedado no <b>Google Cloud Platform</b>, e o server na <b>AWS</b>.",
    "TECHSTACK_P5": "Para o componente gráfico, foi utilizado a biblioteca <b>Fabric.js</b> e customizado cada um de seus recursos para atender as necessidades do projeto.",
    "TECHSTACK_P6": "Outra integração foi com o <b>Imgur</b> para um serviço de biblioteca de imagens para os usuários utilizarem durante as partidas.",

    "TITLE_4":"Recursos Do Table Top",
    "FEATURES_LI_1": "Compartilhamento da mesa em tempo real",
    "FEATURES_LI_2": "Sistema de Revelar para mapa e tokens separadamente, utilizando ferramentas de Bézier",
    "FEATURES_LI_3": "Rolagem de dados de RPG, acumulada ou individual e em quantidade (D2, D4, D6, D8, D10, D12, D20, D100)",
    "FEATURES_LI_4": "Inventário individual para jogadores, com ações de receber e enviar itens",
    "FEATURES_LI_5": "Compartilhamento e gerenciamento de sons de fundo e efeito individual",
    "FEATURES_LI_6": "Chat em Vídeo chamada com funções para especificar ouvintes",
    "FEATURES_LI_7": "Régua em pixel e cadastro de distância para uso na mesa",
    "FEATURES_LI_8": "Carregamento de mapas estáticos e animados",
    "FEATURES_LI_9": "Compartilhamento de imagens entre jogadores",
    "FEATURES_LI_10": "Integração com Imgur, ou uso de links para cadastro e gerenciamento de imagens para uso nas mesas",
    "FEATURES_LI_11": "Camadas entre objetos da mesa",
    "FEATURES_LI_12": "Tokens informativos para status dos jogadores da mesa",
    "FEATURES_LI_13": "Ping em mapa entre jogadores",
    "FEATURES_LI_14": "Redirecionar câmera da mesa para o foco desejado pelo administrador",
    "FEATURES_LI_15": "Ícones para tokens",
    "FEATURES_LI_16": "Duplicar objetos da mesa",
    "FEATURES_LI_17": "Grade para a mesa",
    "FEATURES_LI_18": "Pincel e desenho de formas com controle de tamanho do pincel",
    "FEATURES_LI_19": "Deletar objetos com diversas opções",
    "FEATURES_LI_20": "Vida com barra para tokens",
    "FEATURES_LI_21": "Lista de tokens na cena",
    "FEATURES_LI_22": "Sistema de Toast Messages com implementação sem bibliotecas externas",

    "TITLE_5":"Compartilhamento da mesa em tempo real, Sistema de Revelar para mapa e tokens utilizando ferramentas de Bézier e Chat em Vídeo",
    "FEATURE_1_P1": "Multiplos usuários recebem em tempo real as atualizações da mesa realizadas pelo administrador da sala.",
    "FEATURE_1_P2": "Uma dessas ferramentas de compartilhamento possíveis é o sistema de revelação, onde o administrador pode revelar partes específicas do mapa ou tokens, utilizando ferramentas de Bézier ou através dos próprios objetos da mesa.",
    "FEATURE_1_P3": "Outra feature importante é o chat em vídeo, onde os jogadores podem interagir uns com os outros, e ainda contam com a possibilidade de restringir aqueles que podem ouvir, aumentando assim as possibilidades de cenários durante as partidas.",

    "TITLE_6":"Rolagem de dados de RPG, acumulada ou individual e em quantidade (D2, D4, D6, D8, D10, D12, D20, D100)",
    "FEATURE_2_P1": "O sistema de rolagem de dados permite que os jogadores façam rolagens individuais ou acumuladas, com a possibilidade de escolher a quantidade e o tipo de dado.",
    "FEATURE_2_P2": "As rolagens de dados são feitas em tempo real, e os resultados são compartilhados entre todos os jogadores da mesa.",

    "TITLE_7":"Carregamento de mapas estáticos e animados, e Sistema de pincel e desenho de formas com controle de tamanho do pincel",
    "FEATURE_3_P1": "Os mapas upados pelos usuários podem ser estáticos ou animados, e são carregados na mesa de jogo e apresentados para todos os jogadores.",
    "FEATURE_3_P2": "Estes mapas podem, por exemplo, serem simples links de mapas upados em sistemas de hospedagem de imagens, ou até mesmo sistema de armazenamento em núvem, como Dropbox.",
    "FEATURE_3_P3": "Além disso, os usuários podem desenhar livremente pela cena inteira, o que é compartilhado entre os jogadores.",

    "TITLE_8":"Inventário individual para jogadores e Compartilhamento de imagens",
    "FEATURE_4_P1": "Cada jogador tem seu próprio inventário, onde pode armazenar itens e compartilhá-los com outros jogadores, estes podem ainda ser separados por tipos criados pelo próprio administrador.",
    "FEATURE_4_P2": "É através do inventário que os jogadores podem enviar e receber itens entre si, facilitando a troca de recursos durante o jogo.",
    "FEATURE_4_P3": "Pelo inventário é também onde o administrador pode enviar itens para os jogadores, como recompensas ou equipamentos, e compartilhar imagens para serem exibidas na mesa.",
    "FEATURE_4_P4": "O inventário é uma ferramenta essencial para a dinâmica do jogo, permitindo que os jogadores gerenciem seus recursos de forma eficiente, e vejam informações de cada um dos itens que estão carregando.",

    "TITLE_9":"Compartilhamento e gerenciamento de sons de fundo e efeito individual",
    "FEATURE_5_P1": "Através do sistema de sons, o administrador pode compartilhar sons de fundo e efeitos sonoros, que são reproduzidos em tempo real para todos os jogadores da mesa.",
    "FEATURE_5_P2": "Os sons podem são cadastrados através de links de áudios hospedados em serviços como o <b>SoundCloud</b>, ou até mesmo links diretos de arquivos de áudio e usados durante todo o jogo.",
    "FEATURE_5_P3": "O administrador pode controlar o volume dos sons individualmente, permitindo assim ajustar a experiência de áudio de acordo com sua preferência.",
    "FEATURE_5_P4": "Além de incluir a opção de som em loop, para criar sons de fundo contínuos, ou sons de efeitos que podem ser acionados em momentos específicos do jogo.",

    "TITLE_10":"Régua em pixel, Ícones para tokens e Camadas entre objetos da mesa",
    "FEATURE_6_P1": "Ao utilizar a régua na mesa, o administrador pode compartilhar com os jogadores a distância entre pontos especificos.",
    "FEATURE_6_P2": "Através dos ícones o administrador da mesa cosnegue deixar marcações individuais para seus tokens.",
    "FEATURE_6_P3": "Com o sistema de camadas o administrador consegue organizar em níveis os objetos da mesa.",

    "TITLE_11":"Aprendizados",
    "LEARNINGS_P1": "Com este projeto pude aperfeiçoar meu conhecimento com <b>Angular</b>, <b>NodeJS</b> e <b>Front-end</b> de modo geral.",
    "LEARNINGS_P2": "Além de ter sido excelente poder trabalhar com novas tecnologias como <b>FabricJS</b>, <b>Socket.io</b> e <b>Firebase</b>.",
    "LEARNINGS_P3": "Hoje o <b>Deu Crítico</b> está com o desenvolvimento parado devido ao foco em outros projetos.",
    "LEARNINGS_P4": "Certamente sou um profissional mais completo hoje, o que me permitiria desenvolver esta solução de forma ainda mais completa. Utilizando novos recursos e implementando ainda mais features."
  }
}