{
  "en": {
    "EXP_1_1": "Software Developer",
    "EXP_1_2": "2022 - Present",
    "EXP_1_3": "I work as a Java Backend developer on the Sicredi project, as part of the Concessions and Pricing team. I contribute daily to the development of microservices that support the credit pipeline, enhancing the efficiency and automation of financial processes.",
    "EXP_1_4": "Activities:",
    "EXP_1_5": " → Development of tasks such as implementations, bug fixes, updates, and customizations requested for the Concessions and Pricing team;",
    "EXP_1_6": " → Use of CI/CD tools to automate the software development process;",
    "EXP_1_7": " → Integration of AI-assisted development tools (such as GitHub Copilot) into the project workflow;",
    "EXP_1_8": " → Participation in backlog refinement and technical discussions for upcoming features;",
    "EXP_1_9": " → Support to QA and incident teams to streamline processes;",
    "EXP_1_10": " → Ideation and development of an internal tool to assist the team’s processes and minimize communication gaps;",

    "EXP_2_1": "Software Developer and Technical Lead",
    "EXP_2_2": "2017 - 2022",
    "EXP_2_3": "I worked as a Fullstack developer at EasyPro Tecnologia for 5 years, contributing to various projects from architecture definition to Backend, Web, and Mobile Frontend development, as well as deployment and support.",
    "EXP_2_4": "During this period, I took on the role of technical lead, providing support and guidance to the development team.",
    "EXP_2_5": "Main roles and responsibilities:",
    "EXP_2_6": " → Technical leadership of the software development team and support for other developers;",
    "EXP_2_7": " → Requirement analysis, task estimation, and task allocation among developers;",
    "EXP_2_8": " → Organization of development team sprints;",
    "EXP_2_9": " → Fullstack development of the company’s products;",
    "EXP_2_10": " → Development of tasks such as implementations, bug fixes, updates, and software customizations;",
    "EXP_2_11": " → Responsible for deployments, executing all steps for client-side product installation;",

    "EXP_3_1": "Software Developer",
    "EXP_3_2": "2016 - 2017",
    "EXP_3_3": "At ITS-MC, I worked as a Fullstack developer responsible for building an internal tool for process management.",
    "EXP_3_4": "Main roles and responsibilities:",
    "EXP_3_5": " → Development of tasks such as implementations, bug fixes, updates, and tool customizations;",
    "EXP_3_6": " → Requirement analysis and task estimation;",
    "EXP_3_7": " → Responsible for deployments and completing the installation process for client products;",

    "EXP_4_1": "Software Developer",
    "EXP_4_2": "2012 - 2016",
    "EXP_4_3": "I worked at Altus for four years, starting as an intern and later being hired full-time.",
    "EXP_4_4": "There, I worked with the C# language and also with testing on the MasterTool project.",
    "EXP_4_5": "MasterTool is a communication platform for programmable controllers from the Nexto Series. MasterTool IEC XE is a complete tool for programming, debugging, configuration, and simulation of automation applications.",
    "EXP_4_6": "Main roles:",
    "EXP_4_7": " → Development of tasks such as implementations, bug fixes, updates, and customizations on the MasterTool platform;",
    "EXP_4_8": " → Testing the MasterTool platform;",

    "EXP_5_1": "Intern in Software Development and Testing",
    "EXP_5_2": "2012",
    "EXP_5_3": "I worked for about 6 months as an intern at Gabster, which was my first professional experience with software development and testing.",
    "EXP_5_4": "Main roles:",
    "EXP_5_5": " → Development of the Gabster tool, a plugin for Sketchup;",
    "EXP_5_6": " → Testing of the company’s tools and plugin;"
  },
  "pt": {
    "EXP_1_1": "Desenvolvedor de Software",
    "EXP_1_2": "2022 - Atual",
    "EXP_1_3": "Atuo como desenvolvedor Java Backend no projeto Sicredi, integrando o time de Concessão e Preço. Participo diariamente do desenvolvimento de microsserviços que suportam a esteira de crédito, contribuindo para a eficiência e automação dos processos financeiros.",
    "EXP_1_4": "Atividades:",
    "EXP_1_5": " → Desenvolvimento de tarefas, tais como: implementações, correções, atualizações e customizações solicitadas no projeto para o time de concessão e preço;",
    "EXP_1_6": " → Utilização de ferramentas como CD/CI para automatização do processo de desenvolvimento de software;",
    "EXP_1_7": " → Integração de ferramentas de desenvolvimento assistidas por inteligência artificial (como o GitHub Copilot) ao fluxo de trabalho do projeto;",
    "EXP_1_8": " → Participação nos refinamentos de projeto e técnico das demandas a serem desenvolvidas;",
    "EXP_1_9": " → Suporte ao time de QAs e de incidentes para agilizar processos;",
    "EXP_1_10": " → Idealização e criação de ferramenta individual para auxiliar processos internos do time e minimizar problemas na comunicação;",

    "EXP_2_1": "Desenvolvedor de Software e Líder Técnico",
    "EXP_2_2": "2017-2022",
    "EXP_2_3": "Trabalhei como desenvolvedor Fullstack na EasyPro Tecnologia por 5 anos, atuando em diversos projetos desde a definição da arquitetura até o desenvolvimento Backend, Frontend Web e Mobile, além da implantação e sustentação dos sistemas.",
    "EXP_2_4": "Durante esse período, assumi a liderança técnica da equipe de desenvolvimento, prestando suporte técnico e direcionamento aos demais desenvolvedores.",
    "EXP_2_5": "Principais funções e responsabilidades:",
    "EXP_2_6": " → Liderança técnica da equipe de desenvolvimento de software, e suporte aos demais desenvolvedores;",
    "EXP_2_7": " → Análise e levantamento de requisitos das tarefas, orçamento das horas, e alocação das atividades dos demais desenvolvedores;",
    "EXP_2_8": " → Organização das Sprints da equipe de desenvolvimento;",
    "EXP_2_9": " → Participação do time de desenvolvimento FullStack dos produtos da empresa;",
    "EXP_2_10": " → Desenvolvimento de tarefas, tais como: implementações, correções, atualizações e customizações solicitadas nos softwares;",
    "EXP_2_11": " → Realizações das implantações, executando todas as etapas das instalações dos produtos nos clientes;",

    "EXP_3_1": " → Desenvolvedor de Software;",
    "EXP_3_2": "2016-2017",
    "EXP_3_3": "Atuei na ITS-MC como desenvolvedor FullStack onde era responsável pelo desenvolvimento de uma ferramenta interna para gerenciamento de processos.",
    "EXP_3_4": "Principais funções e responsabilidades:",
    "EXP_3_5": " → Desenvolvimento de tarefas, tais como: implementações, correções, atualizações e customizações solicitadas na ferramenta;",
    "EXP_3_6": " → Análise e levantamento de requisitos das tarefas, orçamento das horas;",
    "EXP_3_7": " → Realizações das implantações, executando todas as etapas das instalações dos produtos no cliente;",

    "EXP_4_1": "Desenvolvedor de Software",
    "EXP_4_2": "2012-2016",
    "EXP_4_3": "Trabalhei na Altus por quatro anos, iniciei como estagiário e posteriormente fui efetivado.",
    "EXP_4_4": "Lá, trabalhei com a linguagem C# e também com testes no projeto MasterTool.",
    "EXP_4_5": "O MasterTool é uma plataforma de comunicação dos controladores programáveis da Série Nexto, o MasterTool IEC XE é uma ferramenta completa para programação, depuração, configuração e simulação de aplicações de automação.",
    "EXP_4_6": "Principais funções:",
    "EXP_4_7": " → Desenvolvimento de tarefas, tais como: implementações, correções, atualizações e customizações solicitadas na plataforma MasterTool;",
    "EXP_4_8": " → Realizações de testes da plataforma MasterTool;",

    "EXP_5_1": "Estágio em Desenvolvimento e Teste de Software",
    "EXP_5_2": "2012",
    "EXP_5_3": "Trabalhei por cerca de 6 meses como estagiário na Gabster, foi meu primeiro contato profissional com desenvolvimento e testes de software.",
    "EXP_5_4": "Principais funções:",
    "EXP_5_5": "→ Desenvolvimento da ferramenta Gabster, um plugin para o Sketchup;",
    "EXP_5_6": " → Testes para as ferramentas e plugin da empresa;"
  }
}