{
  "en": {
    "TITLE_1": "Summary",
    "RESUME_P1": "<b>Green Goblin Project</b> is my first game development project targeting Console and PC platforms.",
    "RESUME_P2": "It’s a game that blends various genres such as adventure, resource management, strategy, exploration, and puzzles.",
    "RESUME_P3": "I chose to develop an open-world game that brings together elements from games I enjoy, aiming to create something that is both a challenge and a gateway to multiple game mechanics and genres.",
    "RESUME_P4": "One of my lifelong dreams has been to dive into the world of games, so I started this project both as a learning journey and a commercial endeavor.",
    "RESUME_P5": "For development, I chose the <b>Unity</b> engine, which uses the <b>C#</b> programming language.",
    "RESUME_P6": "If you'd like to follow updates, you can do so here: <a href=\"https://projectgreengoblin.com\" target=\"_blank\">projectgreengoblin.com</a>",

    "TITLE_2": "The Game",
    "FUNCTIONING_P1": "Green Goblin Project follows the story of a cursed Goblin who gains far more power than he should, serving as a satire of classic RPGs.",
    "FUNCTIONING_P2": "The core idea is that this Goblin is, in fact, a Dungeon Master.",
    "FUNCTIONING_P3": "Players take on the role of managing dungeons by placing creatures, traps, and treasures while exploring the open world and its characters.",

    "TITLE_3": "Technologies and Implementation",
    "TECHSTACK_P1": "The project is being developed in <b>Unity 6</b>, using <b>C#</b> for code implementation.",
    "TECHSTACK_P2": "The art and animations were acquired and integrated from Synty Studios, a company specialized in low-poly 3D art.",
    "TECHSTACK_P3": "The game will be released for both consoles and PC.",

    "TITLE_4": "Features Implemented So Far",
    "FEATURES_LI_1": "Basic character movement – Walk, Run, Jump, Crouch, and Collect",
    "FEATURES_LI_2": "Level Design and UX Design",
    "FEATURES_LI_3": "Automated dungeon execution in real time",
    "FEATURES_LI_4": "Hero, Monster, Trap, and Treasure Generation",
    "FEATURES_LI_5": "Inventory",
    "FEATURES_LI_6": "Stair climbing logic",
    "FEATURES_LI_7": "Spiral stair rail system",
    "FEATURES_LI_8": "Logic for lost items in mesh holes",
    "FEATURES_LI_9": "NPC Movement",
    "FEATURES_LI_10": "NPC Routine System",
    "FEATURES_LI_11": "Dungeon Management Screen",
    "FEATURES_LI_12": "Monster Management Screen",
    "FEATURES_LI_13": "World Map and Location System",
    "FEATURES_LI_14": "Chest prefabs with drops",
    "FEATURES_LI_15": "Notification Canvas",
    "FEATURES_LI_16": "Day/Night System with hours, days, and years",
    "FEATURES_LI_17": "Save and Load System",
    "FEATURES_LI_18": "Cinemachine Configuration",
    "FEATURES_LI_19": "Character transparency based on camera collision",
    "FEATURES_LI_20": "Item pickup using proximity validation and raycast",
    "FEATURES_LI_21": "Lighting and post-processing system",
    "FEATURES_LI_22": "Optimization techniques such as LOD and Occlusion Culling",
    "FEATURES_LI_23": "Narrative Development",

    "TITLE_5": "Inventory",
    "FEATURE_1_P1": "One of the main implementations so far has been the inventory, a core element in most games, which is why it was prioritized early in development.",
    "FEATURE_1_P2": "It was designed to be intuitive and user-friendly, allowing players to manage their items efficiently.",
    "FEATURE_1_P3": "It includes features like drag-and-drop, category-based sorting, and a user-friendly interface for easy navigation.",
    "FEATURE_1_P4": "Moreover, the inventory integrates with other game mechanics like item pickup, chest interaction, and the notification system.",

    "TITLE_6": "Spiral Stair Rail System",
    "FEATURE_2_P1": "One of the initial challenges has been ensuring a smooth and enjoyable user experience.",
    "FEATURE_2_P2": "Something that always bothered me in games is clunky or hard-to-control movement, especially during sections involving spiral staircases where the camera must be carefully handled to avoid confusion.",
    "FEATURE_2_P3": "To address this, a spiral stair rail system was implemented, allowing the player to climb and descend stairs intuitively and smoothly, improving the overall experience and solving issues related to awkward movement and difficult camera angles.",

    "TITLE_7": "Chest Prefabs with Drops & Pickup Mechanic",
    "FEATURE_3_P1": "Another feature implemented so far is the creation of chest prefabs and the entire loot logic, where chests can be visually customized and configured to drop specific items.",
    "FEATURE_3_P2": "The prefab was designed to be easy to visually modify and intuitive to configure for item types and drop chances.",
    "FEATURE_3_P3": "The logic ensures that players can collect items from the ground/chests using proximity validation and raycasting, providing a smooth and intuitive collection experience.",

    "TITLE_8": "Automated Dungeon Execution, Hero/Monster/Trap/Treasure Generation, and Dungeon Management Screen",
    "FEATURE_4_P1": "So far, one of the most important and complex mechanics implemented has been the real-time execution of dungeons.",
    "FEATURE_4_P2": "This mechanic follows logical and game design rules to create a situational AI capable of executing predefined behaviors.",
    "FEATURE_4_P3": "The AI controls the heroes and creatures, generated based on dungeon criteria or placed by the player, making decisions based on attributes, modifiers, and character health.",
    "FEATURE_4_P4": "The goal was to create a complex system inspired by RPG systems like D&D and Call of Cthulhu.",
    "FEATURE_4_P5": "In terms of gameplay, players will manage their dungeons through a dedicated screen where they can view and interact with monsters, traps, and treasures, and monitor progress and performance.",
    "FEATURE_4_P6": "The idea is to create a kind of chess-like game, where the pieces are heroes and monsters, and the player must strategically organize their dungeon.",

    "TITLE_9": "Learnings",
    "LEARNINGS_P1": "I've been learning a lot through this project, not only in programming but also in game design and development.",
    "LEARNINGS_P2": "Working with Unity has been incredibly enriching, allowing me to explore new techniques and approaches to solve complex problems.",
    "LEARNINGS_P3": "The project also challenges me to think creatively and find innovative solutions to issues that arise during development.",
    "LEARNINGS_P4": "Each day, working on game development feels like stepping into the world I've always dreamed of being a part of.",
    "LEARNINGS_P5": "This is still an ongoing project, with new features being added and constant improvements being made.",
    "LEARNINGS_P6": "If you’re interested in following the updates, you can do so here: <a href=\"https://projectgreengoblin.com\" target=\"_blank\">projectgreengoblin.com</a>"
  },
  "pt": {
    "TITLE_1":"Resumo",
    "RESUME_P1": "O <b>Projeto Green Goblin</b> é meu primeiro projeto de jogo desenvolvido para as plataformas de Console e PC.",
    "RESUME_P2": "Se trata de um jogo que mistura vários estilos, como por exemplo: adventure, gerenciamento de recursos, estratégia, exploração e puzzles.",
    "RESUME_P3": "Escolhi desenvolver um jogo de mundo aberto, trazendo diversos elementos de jogos que gosto, e que pudessem ser ao mesmo tempo que um desafio, uma porta de entrada que abrangesse diversas áreas e mecânicas de jogos.",
    "RESUME_P4": "Um dos meus sonhos sempre foi mergulhar no universo dos jogos, e por isso, resolvi iniciar este projeto tanto para começar meus estudos mas também como um projeto comercial.",
    "RESUME_P5": "Para o desenvolvimento, foi escolhido utilizar a engine <b>Unity</b> que faz uso da linguagem de programação <b>C#</b>.",
    "RESUME_P6": "Se tiver interesse em acompanhar novidades, pode fazer isso por aqui: <a href=\"https://projectgreengoblin.com\" target=\"_blank\">projectgreengoblin.com</a>",
    
    "TITLE_2":"O Jogo",
    "FUNCTIONING_P1": "O Projeto Green Goblin segue a história de um Goblin enfeitiçado que obteve um poder muito maior do que deveria, trazendo uma grande sátira aos RPGs clássicos",
    "FUNCTIONING_P2": "A ideia do jogo gira em torno deste Goblin ser, na verdade, um Mestre de Dungeons.",
    "FUNCTIONING_P3": "Os jogadores assumem o papel de gerenciar dungeons, alocando criaturas, armadilhas e tesouros, enquanto exploram o mundo aberto do jogo e seus personagens.",

    "TITLE_3":"Tecnologias e Implementação",
    "TECHSTACK_P1": "O projeto vem sendo desenvolvido com <b>Unity 6</b>, utilizando <b>C#</b> para a implementação dos códigos.",
    "TECHSTACK_P2": "As artes e animações foram adquiridas e integradas ao jogo pela Synty Studios, uma empresa especializada em artes 3D no estilo low poly.",
    "TECHSTACK_P3": "O projeto será lançado para consoles e PC.",

    "TITLE_4":"Algumas Implementações até aqui",
    "FEATURES_LI_1": "Movimentação base do personagem - Andar, Correr, Pular, Abaixar e Coletar",
    "FEATURES_LI_2": "Level Design e UX Design",
    "FEATURES_LI_3": "Execução automatizada de dungeons em tempo real",
    "FEATURES_LI_4": "Geração de Heróis, Monstros, Armadilhas e Tesouros",
    "FEATURES_LI_5": "Inventário",
    "FEATURES_LI_6": "Lógica para subida de escadas",
    "FEATURES_LI_7": "Trilho para escadas em caracol",
    "FEATURES_LI_8": "Lógica para itens perdidos em buracos de mesh",
    "FEATURES_LI_9": "Movimentação de NPCs",
    "FEATURES_LI_10": "Sistema de rotinas para NPCs",
    "FEATURES_LI_11": "Tela de Gerenciamento de Dungeon",
    "FEATURES_LI_12": "Tela de Gerenciamento de Monstros",
    "FEATURES_LI_13": "Sistema de Mapa e Localidades do jogo",
    "FEATURES_LI_14": "Prefabs de Baús com drops",
    "FEATURES_LI_15": "Canvas de Notificação",
    "FEATURES_LI_16": "Sistema de Dia/Noite com horas, dias e anos",
    "FEATURES_LI_17": "Sistema de Save e Load",
    "FEATURES_LI_18": "Configuração da Cinemachine",
    "FEATURES_LI_19": "Implementação de transparência do personagem detectado por colisão com a camêra",
    "FEATURES_LI_20": "Coletar drops do chão com validação de proximidade e raycast",
    "FEATURES_LI_21": "Implementação da Iluminação e sistema de pós processamento",
    "FEATURES_LI_22": "Configuração de tecnicas de otimização como objetos com LOD (Level of Detail) e Occlusion Culling",
    "FEATURES_LI_23": "Desenvolvimento da narrativa",

    "TITLE_5":"Inventário",
    "FEATURE_1_P1": "Uma das principais implementações até o momento foi o inventário, parte fundamental da grande maioria dos jogos, e por isso, foi priorizado no começo do desenvolvimento.",
    "FEATURE_1_P2": "Ele foi desenvolvido para ser intuitivo e fácil de usar, permitindo que os jogadores gerenciem seus itens de forma eficiente.",
    "FEATURE_1_P3": "Ele inclui funcionalidades como arrastar e soltar itens, organização por categorias, e uma interface amigável que facilita a navegação.",
    "FEATURE_1_P4": "Além disso, o inventário é integrado com outras mecânicas do jogo, como a coleta de itens e a interação com baús, e sistema de notificação.",

    "TITLE_6":"Trilho para escadas em caracol",
    "FEATURE_2_P1": "Um dos desafios iniciais está sendo garantir a boa experiência do usuário e jogabilidade fluída e agradável.",
    "FEATURE_2_P2": "Algo que sempre me incomodou em jogos foi uma movimentação do personagem complexa, e de dificil controle, como em momentos como os de escadas caracol, onde a camâmera precisa ser controlada com cuidado para não gerar confusão durante a subida.",
    "FEATURE_2_P3": "Para resolver este problema, foi implementado um sistema de trilho para escadas em caracol, que permite ao jogador subir e descer escadas de maneira intuitiva, fluida, e fácil, sem comprometer a experiência e resolvendo problemas de movimentação truncada, e câmeras dificeis de controlar.",

    "TITLE_7":"Prefabs de Baús com drops e Mecânica de Coleta",
    "FEATURE_3_P1": "Outra implementação feita até o momento foram a criação de prefabs de baús e toda lógica de drops, onde os baús podem ser criados com a aparência desejada, onde quer que seja e configurados para resultarem nos drops desejados.",
    "FEATURE_3_P2": "O prefab foi construído de forma que, além de fácil troca do seu visual, também é intuítiva a forma de configurar seus itens e chances de drop.",
    "FEATURE_3_P3": "A lógica foi feita para que o jogador possa coletar os itens do chão/baú, com validação de proximidade e raycast, garantindo uma experiência de coleta fluída e intuitiva.",

    "TITLE_8":"Execução automatizada de dungeons em tempo real, Geração de Heróis, Monstros, Armadilhas e Tesouros e Tela de Gerenciamento de Dungeon",
    "FEATURE_4_P1": "Até o momento, a execução das dungeons em tempo real foi uma das mecânicas do jogo mais importantes e complexas implementadas.",
    "FEATURE_4_P2": "Ela seguirá regras lógicas e de game design para a criação de uma IA situacional que irá determinar ações pré-estabelecidas que já foram programadas.",
    "FEATURE_4_P3": "A IA será responsável por controlar os heróis e criaturas, que são gerados de acordo com critériops de dungeons ou alocados pelos usuários, tomando decisões baseadas em fatores como atributos, modificadores, ou a saúde dos personagens.",
    "FEATURE_4_P4": "A ideia aqui foi criar um sistema complexo similar aos encontrados em sistemas de RPG como D&D e Call of Cthulu.",
    "FEATURE_4_P5": "Em questão de jogabilidade, é na tela de gerenciamento de dungeon onde o jogador poderá visualizar e interagir com suas dungeons, monstros, armadilhas e tesouros alocados, além de monitorar o progresso e o desempenho das mesmas.",
    "FEATURE_4_P6": "O objetivo é gerar uma espécia de jogo de xadrez, onde as peças são os heróis e monstros, e então, de maneira estratégica o jogador deverá organizar sua dungeon.",
    
    "TITLE_9":"Aprendizados",
    "LEARNINGS_P1": "Venho aprendendo muito com o projeto, tanto em termos de programação quanto de design e desenvolvimento de jogos.",
    "LEARNINGS_P2": "A experiência de trabalhar com Unity tem sido extremamente enriquecedora, permitindo-me explorar novas técnicas e abordagens para resolver problemas complexos.",
    "LEARNINGS_P3": "Além disso, o projeto tem me desafiado a pensar de forma criativa e a encontrar soluções inovadoras para os desafios que surgem durante o desenvolvimento.",
    "LEARNINGS_P4": "Trabalhar com o desenvolvimento de jogos se mostra a cada dia como um novo mundo onde eu sempre quis estar.",
    "LEARNINGS_P5": "Este é um projeto que ainda está em desenvolvimento, com novas funcionalidades sendo adicionadas e melhorias sendo feitas constantemente.",
    "LEARNINGS_P6": "Se você tem interesse em acompanhar novidades, você pode fazer isso por aqui: <a href=\"https://projectgreengoblin.com\" target=\"_blank\">projectgreengoblin.com</a>"
  }
}